Revit 2026 API

# AssemblyInstanceCanRemoveElementsFromAssembly Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanRemoveElementsFromAssembly(
	AssemblyInstance assemblyInstance,
	ICollection<ElementId> memberIds
)
```
```vb
Public Shared Function CanRemoveElementsFromAssembly (
	assemblyInstance As AssemblyInstance,
	memberIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CanRemoveElementsFromAssembly(
	AssemblyInstance^ assemblyInstance,
	ICollection<ElementId^>^ memberIds
)
```
```fsharp
static member CanRemoveElementsFromAssembly :
        assemblyInstance : AssemblyInstance *
        memberIds : ICollection<ElementId> -> bool
```

#### Parameters

assemblyInstance AssemblyInstance

memberIds ICollectionElementId

#### Return Value

Boolean

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace